{
  "text_strings": [
    {
      "id": "new_game_title",
      "languages":
        {
          "cz": "Nová hra",
          "en": "New Game"
        }
    },
    {
      "id": "how_to_title",
      "languages":
        {
          "cz": "Jak hrát",
          "en": "How To Play"
        }
    },
    {
      "id": "pause_text",
      "languages":
        {
          "cz": "pauza",
          "en": "pause"
        }
    },
    {
      "id": "restart_text",
      "languages":
        {
          "cz": "Restartovat",
          "en": "Restart"
        }
    },
    {
      "id": "back_text",
      "languages":
        {
          "cz": "Zpět",
          "en": "Back"
        }
    },
    {
      "id": "restart_notification",
      "languages":
        {
          "cz": "Stiskni jakoukoli klávesu pro restart",
          "en": "Press any key to restart"
        }
    },
    {
      "id": "great_job",
      "languages":
        {
          "cz": "Skvělá práce!",
          "en": "Great job!"
        }
    },
    {
      "id": "level1_name",
      "languages":
        {
          "cz": "Šnečí stezka",
          "en": "Snail Path"
        }
    },
    {
      "id": "level2_name",
      "languages":
        {
          "cz": "Zrádné vody",
          "en": "Treacherous Waters"
        }
    },
    {
      "id": "level3_name",
      "languages":
        {
          "cz": "Triky a pasti",
          "en": "Tricks and Traps"
        }
    },
    {
      "id": "level4_name",
      "languages":
        {
          "cz": "Klesání",
          "en": "Descent"
        }
    },
    {
      "id": "level5_name",
      "languages":
        {
          "cz": "?",
          "en": "?"
        }
    },
    {
      "id": "level1_dialogue",
      "languages":
        {
          "cz": "Tak, mělo by to fungovat. Raz, dva, tři... Haló, slyšíme se? Výborně. Jsem Anya, tvoje operátorka. Těší mě. Koukla jsem do tvé složky a musím uznat, že tvé skóre z univerzity je... impozantní. Říkají o tobě, že máš potenciál být nejlepší pilot od dob Quinna Floyda. Upřímně, to dneska říkají o každém druhém. Musím tě rozhodně upozornit, že tvé dosavadní zkušenosti ze simulátoru ti tady moc nepomohou. Najít dobrá ložiska je těžší a těžší, musíme stále hlouběji a hlouběji, kde ještě nikdo nebyl. Pro začátek jsem ti našla docela klidné místečko, aby ses trochu rozcvičil. Moc rudy tady není, ale aspoň si hned první den nenaděláš do gatí.",
          "en": "English text for the test level. It should be properly organized to multiple pages. All pages, excluding the last one, should have blinking cursor indicating the option to navigate to the next page."
        }
    },
    {
      "id": "level2_dialogue",
      "languages":
        {
          "cz": "Hotovo? Ani jsem nestihla dopít kafe. Krapet tedy přitvrdíme, ať to není úplná nuda... Takže co tu máme? Hmm... Hektorské jeskyně jsou blízko. Dobrá lokace, kdyby to tam lidi z Marinetechu komplet nezaminovali. Teď tam nemůžeme ani my, ani oni. Je to banda bláznů, to ti povím, není divu, že jim komise vzala licenci. Víš co, zkusíme jeskyni v sektoru 26, dvacet kilometrů na sever. Dlouho tam nikdo nebyl a sondy nahlásily pozitivní nálezy. Voda tam je trochu zrádná, to je pravda... Ale nic, s čím by sis neporadil. Takže je rozhodnuto, máš zelenou. Pořádně to tam vymeť, ať mají kraváťáci radost.",
          "en": "{level2_en}"
        }
    },
    {
      "id": "level3",
      "languages":
        {
          "cz": "To nebylo špatné, vážně ne. S takovou budeme mít za chvíli splněnou normu a ještě dosáhnem na prémie. Super, jedeme dál. Myslím, že rozehřívací kolo máme za sebou, takže půjdeme o něco hlouběji, ať je trochu legrace. Nezapomeň, že čím hlouběji jdeme, tím větší bude zastoupení tamní fauny. Plus zase detekuju nějaké signály Marinetechu, asi miny. Ach jo. Měj oči na šťopkách, ať tě nic nepřekvapí. Byla by škoda o tebe přijít hned první den, zvláště když se ti tak daří.",
          "en": "{level3_en}"
        }
    },
    {
      "id": "level4",
      "languages":
        {
          "cz": "Máš pevné nervy, to se musí nechat. Poslední člověk, kterého jsem tady dolů poslala, to vzdal po necelých deseti minutách. Přes noc si ho nechali na pozorování, další den nám na stole nechal papíry a odešel. Prý už nikdy v životě nechce vidět ani jednu rybí ploutev, to raději bude nadosmrti drhnout špinavá záchodová prkýnka. Ty to tam dole viditelně snášíš o něco lépe. Nevím, kde ses naučil ty svoje manévry, ale funguje to. Teď jen doufat, že ti štěstí vydrží.",
          "en": "{level4_en}"
        }
    },
    {
      "id": "level5",
      "languages":
        {
          "cz": "{level5_cz}",
          "en": "{level5_en}"
        }
    },
    {
      "id": "level6",
      "languages":
        {
          "cz": "{level6_cz}",
          "en": "{level6_en}"
        }
    },
    {
      "id": "level7",
      "languages":
        {
          "cz": "{level7_cz}",
          "en": "{level7_en}"
        }
    },
    {
      "id": "level8",
      "languages":
        {
          "cz": "{level8_cz}",
          "en": "{level8_en}"
        }
    }
  ]
}